#pragma once
#include <iostream>

using std::cin;
using std::cout;

// Перетворює прості арифметичні вирази з інфіксної форми до постфіксної
// операндами можуть бути одноцифрові натуральні числа
// операціями - бінарні + - * /
void PostfixLight();

// Перетворює арифметичні вирази з дужками. Операнди одноцифрові.
void Postfix();

// Перетворює арифметичні вирази з багатоцифровими операндами
void PostfixExt();

// Перетворює і обчислює арифметичні вирази з дужками. Операнди одноцифрові.
void TranslateAndCalculate();
